## Q1

In [1]:
import pandas as pd

In [2]:
marks=pd.DataFrame({'Name': ['John', 'Anna','Emma'], 'Business statistics':[65,72,56],'Simulation':[60,65,64]})

In [4]:
marks[['Simulation']]

   Simulation
0          60
1          65
2          64

In [5]:
marks.loc[0]

Name                   John
Business statistics      65
Simulation               60
Name: 0, dtype: object

In [8]:
marks.drop(["Simulation"], axis=1)

   Name  Business statistics
0  John                   65
1  Anna                   72
2  Emma                   56

In [9]:
marks.drop(2)

   Name  Business statistics  Simulation
0  John                   65          60
1  Anna                   72          65

In [10]:
marks['Grades'] =  ['Merit', 'Merit','Merit']

In [11]:
marks

   Name  Business statistics  Simulation Grades
0  John                   65          60  Merit
1  Anna                   72          65  Merit
2  Emma                   56          64  Merit

## Q2

In [12]:
matrix1 = [(1,2,6,2),(0,7,1,3),(4,0,2,1)];
matrix2 = [(5,2,3,2),(2,1,4,4),(2,5,7,1)];

In [15]:
df1 = pd.DataFrame(data=matrix1);
df2 = pd.DataFrame(data=matrix2);

In [17]:
addition = df1 + df2
subtraction = df1 - df2
multiply = df1 * df2
divide = df1/df2

In [18]:
addition

   0  1  2  3
0  6  4  9  4
1  2  8  5  7
2  6  5  9  2

In [19]:
subtraction

   0  1  2  3
0 -4  0  3  0
1 -2  6 -3 -1
2  2 -5 -5  0

In [20]:
multiply

   0  1   2   3
0  5  4  18   4
1  0  7   4  12
2  8  0  14   1

In [21]:
divide

     0    1         2     3
0  0.2  1.0  2.000000  1.00
1  0.0  7.0  0.250000  0.75
2  2.0  0.0  0.285714  1.00

In [22]:
df3 = df2.transpose()
dotprod = df1.dot(df3)

In [23]:
dotprod

    0   1   2
0  31  36  56
1  23  23  45
2  28  20  23

## Q3

In [29]:
AE_df = pd.read_csv("Adult_Exercise.csv")

In [30]:
AE_df.head()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [31]:
AE_df.tail()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours-per-week,native-country,income
4995,43,Private,222971,5th-6th,3,Never-married,Machine-op-inspct,Unmarried,White,Female,0,0,40,Mexico,<=50K
4996,31,Private,259425,HS-grad,9,Married-civ-spouse,Craft-repair,Husband,White,Male,0,0,40,United-States,>50K
4997,47,Self-emp-inc,212120,HS-grad,9,Married-civ-spouse,Craft-repair,Husband,White,Male,0,0,40,United-States,>50K
4998,26,Private,245880,HS-grad,9,Never-married,Adm-clerical,Not-in-family,White,Male,0,0,60,United-States,<=50K
4999,58,Local-gov,54947,Some-college,10,Never-married,Prof-specialty,Not-in-family,White,Female,0,0,55,United-States,<=50K

In [32]:
AE_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             5000 non-null   int64
 1   workclass       5000 non-null   object
 2   fnlwgt          5000 non-null   int64
 3   education       5000 non-null   object
 4   education_num   5000 non-null   int64
 5   marital_status  5000 non-null   object
 6   occupation      5000 non-null   object
 7   relationship    5000 non-null   object
 8   race            5000 non-null   object
 9   sex             5000 non-null   object
 10  capital_gain    5000 non-null   int64
 11  capital_loss    5000 non-null   int64
 12  hours-per-week  5000 non-null   int64
 13  native-country  5000 non-null   object
 14  income          5000 non-null   object
dtypes: int64(6), object(9)
memory usage: 586.1+ KB

In [33]:
AE_df.describe()

,age,fnlwgt,education_num,capital_gain,capital_loss,hours-per-week
count,5000.000000,5.000000e+03,5000.000000,5000.000000,5000.000000,5000.000000
mean,38.600200,1.907684e+05,10.079600,1033.640200,93.696800,40.519000
std,13.594695,1.063596e+05,2.534906,7051.802077,410.801418,12.109193
min,17.000000,1.930200e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.176958e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.794750e+05,10.000000,0.000000,0.000000,40.000000
75%,47.000000,2.416575e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.033222e+06,16.000000,99999.000000,2547.000000,99.000000

In [34]:
basicStatistics = AE_df.describe()

In [35]:
AE_df=AE_df.rename(columns={'hours-per-week':'hours_per_week'})

In [37]:
AE_df.hours_per_week.describe()

count    5000.000000
mean       40.519000
std        12.109193
min         1.000000
25%        40.000000
50%        40.000000
75%        45.000000
max        99.000000
Name: hours_per_week, dtype: float64

In [38]:
basicStatistics.to_csv("bS.csv")

In [39]:
Sampled_df = AE_df.sample(n=1000, random_state=1)

In [40]:
Sampled_df.shape

(1000, 15)